* 1.6 using functions
  - mapcar
    - Ex01
      #+begin_src lisp
	   (mapcar #'+ '(1 2 3 4) '(10 20 30 40))
      #+end_src

      #+RESULTS:
      | 11 | 22 | 33 | 44 |

    - Ex02q
      #+begin_src lisp
	(mapcar #'- '(1 2 3 4))
      #+end_src

      #+RESULTS:
      | -1 | -2 | -3 | -4 |


* High-order functions      
  - Define our =mappend=
    - =mappend= which has the same effect of =mapcan=
      #+begin_src lisp
	(defun mappend (fn lst)
	  "Apply fn to each element of list and append the results"
	  (apply #'append (mapcar fn lst)))
      #+end_src

      #+RESULTS:
      : MAPPEND

    - Ex01
      #+begin_src lisp
	(defun self-and-double (x)
	  (list x (+ x x)))

	(mappend #'self-and-double '(1 10 300))
      #+end_src

      #+RESULTS:
      | 1 | 2 | 10 | 20 | 300 | 600 |

    - Lambda
      If we want to refer to a function in a position other than the first element of a function call, we have to use the #' notation. Otherwise, the expressions will be evaluated by the normal evaluation rule, and will not be treated as functions.
      The importance of lambda is that we could make run-time functions.

      - Ex01
	#+begin_src lisp
	  (mapcar #'(lambda (x)
		      (+ x x))
		  '(1 2 3 4 5))
	#+end_src

	#+RESULTS:
	| 2 | 4 | 6 | 8 | 10 |

